# Chapter 9. Dictionary

### Lab 6

In [28]:
# DataFrame Example

import pandas as pd

# df1 = pd.DataFrame(
#     {
#         "A": 1.0,
#         "B": pd.Timestamp("20130102"),
#         "C": pd.Series(1, index=list(range(4)), dtype="float32"),
#         # "D": np.array([3] * 4, dtype="int32"),
#         "D": [10, 20, 30, 40],
#         "E": pd.Categorical(["test", "train", "test", "train"]),
#         "F": "foo",
#     }
# )

df1 = pd.DataFrame(
    {
        "A": 1.0,
        "B": ['James', 'John', 'Mary', 'Bill'],
        "C": ['A', 'B', 'C', 'D'],
        # "D": np.array([3] * 4, dtype="int32"),
        "D": [10, 20, 30, 40],
        "E": range(4),
        "F": "foo",
    }
)

df1

     A      B  C   D  E    F
0  1.0  James  A  10  0  foo
1  1.0   John  B  20  1  foo
2  1.0   Mary  C  30  2  foo
3  1.0   Bill  D  40  3  foo

In [29]:
df2 = pd.DataFrame(
    {
        'A': ['a', 'b', 'c'],
        'B': range(3),
        'C': [0,1,2]
    }
)
df2

   A  B  C
0  a  0  0
1  b  1  1
2  c  2  2

In [30]:
df2.columns

Index(['A', 'B', 'C'], dtype='object')

In [31]:
df2['A']

0    a
1    b
2    c
Name: A, dtype: object

In [32]:
df2.iloc[2]['B']

2

In [36]:
df = pd.read_excel('students.xlsx')
print (df.shape)
print (df.shape[0])
print (df.shape[1])
df

(4, 5)
4
5

          Name         ID  Math  English  Computer
0     John Doe  2022-0002   100       90        90
1     Jane Doe  2023-0001    70      100        90
2   Mary Smith  2023-0002   100      100       100
3  Bill Watson  2023-0003   100       75        85

In [39]:
for v in df.iloc[0]:
    print (v, end=' ')
print ()

John Doe 2022-0002 100 90 90

In [46]:
df.iloc[0]

Name         John Doe
ID          2022-0002
Math              100
English            90
Computer           90
Name: 0, dtype: object

In [47]:
df.iloc[0]['Name']

'John Doe'

In [57]:
keys = df.columns
print (keys)

for k in keys:
    print (k, end = ' ')

keys = list(keys)

for i in range(len(keys)):
    print (keys[i], end=' ')
print ()

d1 = {}
d1[keys[0]] = df.iloc[0][keys[0]]
d1[keys[1]] = df.iloc[0][keys[1]]
d1[keys[2]] = df.iloc[0][keys[2]]
d1[keys[3]] = df.iloc[0][keys[3]]
d1[keys[4]] = df.iloc[0][keys[4]]
print (d1)

d2 = {}
d2[keys[0]] = df.iloc[1][keys[0]]
d2[keys[1]] = df.iloc[1][keys[1]]
d2[keys[2]] = df.iloc[1][keys[2]]
d2[keys[3]] = df.iloc[1][keys[3]]
d2[keys[4]] = df.iloc[1][keys[4]]
print (d2)

Index(['Name', 'ID', 'Math', 'English', 'Computer'], dtype='object')
Name ID Math English Computer Name ID Math English Computer
{'Name': 'John Doe', 'ID': '2022-0002', 'Math': 100, 'English': 90, 'Computer': 90}
{'Name': 'Jane Doe', 'ID': '2023-0001', 'Math': 70, 'English': 100, 'Computer': 90}

In [66]:
keys = df.columns
students = []
d1 = {}
for ridx in range(df.shape[0]):
	for i, v in enumerate(df.iloc[ridx]):
		d1[keys[i]] = df.iloc[ridx][keys[i]]
	print (d1)
	students.append(d1)

print (students)

{'Name': 'John Doe', 'ID': '2022-0002', 'Math': 100, 'English': 90, 'Computer': 90}
{'Name': 'Jane Doe', 'ID': '2023-0001', 'Math': 70, 'English': 100, 'Computer': 90}
{'Name': 'Mary Smith', 'ID': '2023-0002', 'Math': 100, 'English': 100, 'Computer': 100}
{'Name': 'Bill Watson', 'ID': '2023-0003', 'Math': 100, 'English': 75, 'Computer': 85}
[{'Name': 'Bill Watson', 'ID': '2023-0003', 'Math': 100, 'English': 75, 'Computer': 85}, {'Name': 'Bill Watson', 'ID': '2023-0003', 'Math': 100, 'English': 75, 'Computer': 85}, {'Name': 'Bill Watson', 'ID': '2023-0003', 'Math': 100, 'English': 75, 'Computer': 85}, {'Name': 'Bill Watson', 'ID': '2023-0003', 'Math': 100, 'English': 75, 'Computer': 85}]

In [72]:
# Enum

l = [10, 20, 30]

for v in l:
    print (v, end = ' ')
print ()
for i in range(len(l)):
    print (l[i], end = ' ')
print ()

for i, v in enumerate(l):
    print (i, v)

10 20 30
10 20 30
0 10
1 20
2 30

# Lab 6

## makeStudentDictionary()

In [87]:
import pandas as pd

def makeStudentDicitonary():
	df = pd.read_excel('students.xlsx')
	keys = df.columns
	students = []
	for ridx in range(df.shape[0]):
		d1 = {}
		for i, v in enumerate(df.iloc[ridx]):
			d1[keys[i]] = df.iloc[ridx][keys[i]]
		# print (d1)
		students.append(d1)
	return students

def printStudnet(students):
	# for i in range(len(students)):
	for student in students:
		for k, v in student.items():
			print (f'{k} -> {v} \t', end= ' ')
		print ()
def findStudent(students, id):
	score = []
	for student in students:
		if student['ID'] == id:
			score.append(student['Math'])
			score.append(student['English'])
			score.append(student['Computer'])
	return score

students = makeStudentDicitonary()
printStudnet(students) 
score = findStudent(students, '2023-0003') # Query
print (score)

# print (students)

Name -> John Doe 	 ID -> 2022-0002 	 Math -> 100 	 English -> 90 	 Computer -> 90
Name -> Jane Doe 	 ID -> 2023-0001 	 Math -> 70 	 English -> 100 	 Computer -> 90
Name -> Mary Smith 	 ID -> 2023-0002 	 Math -> 100 	 English -> 100 	 Computer -> 100
Name -> Bill Watson 	 ID -> 2023-0003 	 Math -> 100 	 English -> 75 	 Computer -> 85
[100, 75, 85]